---
kind: method
id: M:Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetDeletedElementIds
source: html/4617b634-48cf-1a37-1dc3-4edf37647363.htm
---
# Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetDeletedElementIds Method

Returns set of elements that were deleted from the document.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetDeletedElementIds()
```

## Returns
The set of ElementId for elements that were deleted from the document.